docs: update Architecture file with overall structure, and fixed a few inconsitencies and bugs
